package days02;

/**
 * @author jam
 * @date 2024. 7. 2. - 오후 2:52:02
 * @subject  숫자(정수계열)
 * @content  byte(1), short(2), int(4), long(8)
 *
 */
public class Ex05_03 {

	public static void main(String[] args) {

		/*
		 * [진법]
		 * 1. 10진법 - 0 1 2 3 4 5 6 7 8 9
		 * 2. 2진법  - 0 1
		 * 3. 8진법  - 0 1 2 3 4 5 6 7
		 * 4. 16진법 - 0 1 2 3 4 5 6 7 8 9 a(10) b(11) c(12) d(13) e(14) f(15)
		 *
		 * 0 1
		 *
		 * 1bit    [0]   [1] 2가지 표현
		 *
		 * byte(1)
		 * 1byte == 8bit  [부호비트][][][][][][][] 2^7==128 가지
		 *    -128 0 127
		 *
		 * short(2)
		 * 2byte == 16bit [부호비트][][][][][][][]  [][][][][][][][] 2^15==32768 가지
		 *   -32768 0 32767
		 * int(4) == 32bit  2^31= 2,147,483,648   21억
		 *   -21억 ~ 21억
		 * long(8) == 64bit 2^63= 9,223,372,036,854,775,808  900경
		 *   -900경 ~ 900경
		 *
		 * 4:03 수업시작
		 * */

		// 사람의 나이를 저장할 변수 선언.
		byte age = 10;
		// [][][][][1][0][1][0]
		// 국어점수를 저장할 변수 선언.
		byte kor;

		// 접미사   d/D    L/l
		// 10.0
		// 10.
		// 10D  10d

		// 10L  10l
		// 10    int     1010
		// [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][1][0][1][0]
		int i = 10;
		// long l = 10L;
		long l = 10;  // 자동 타입 변환   int=>long 형변환

		//Type mismatch: cannot convert from double to float
		float f = 3.14F;  // 3.14f
		double d = 3.14;


		System.out.printf("%d %d %f %f\n", 100, 100L, 3.14F, 3.14D);

	} // main

} // class








